Literate-Hacking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-07 Sat 14:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content" class="content">
<ul class="org-ul">
<li><a href="index.html">home</a></li>
</ul>
<div id="outline-container-org360af0d" class="outline-2">
<h2 id="org360af0d">Literate Hacking</h2>
<div class="outline-text-2" id="text-org360af0d">
<p>
I found <a href="http://howardism.org/Technical/Emacs/literate-devops.html">this</a> blog post that goes into the concept "Literate DevOps" where everything is executed in Emacs. I don't do DevOps but I am a penetration tester that uses Emacs, so I've came up with the concept <i>Literate Hacking</i>.
</p>
</div>
<div id="outline-container-org704a7ca" class="outline-3">
<h3 id="org704a7ca">Notes File</h3>
<div class="outline-text-3" id="text-org704a7ca">
<p>
Like any other penetration tester, I take notes when on a project so i can recall what I've found / done. I've been taking my notes in an <code>org-mode</code> document for some time now, as well as <i>staging</i> my report in the same document so I can reference it later down the line if need be.
</p>

<p>
Like most other penetration testers I dint have the tools on my local system, I'll normally <code>ssh</code> to a virtual machine and run the tools from that device, then work with <code>scp</code> to get all the data off later. Or now days I'll use a docker container. Literate Hacking allows me to define code blocks in my notes file and then execute it on the virtual machine via <code>ssh</code>. 
</p>
</div>
<div id="outline-container-orgdc2d2aa" class="outline-4">
<h4 id="orgdc2d2aa">Example</h4>
<div class="outline-text-4" id="text-orgdc2d2aa">
<p>
First I'll show the example, then I'll show the <code>org-mode</code> code for it.
In this example I'll just pull the <code>IP</code> of the remote server.
</p>
<div class="org-src-container">
<pre class="src src-shell">ip addr
</pre>
</div>

<pre class="example" id="org3367492">
1: lo: &lt;LOOPBACK,UP,LOWER_UP&gt; mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1
link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00
    inet 127.0.0.1/8 scope host lo
       valid_lft forever preferred_lft forever
    inet6 ::1/128 scope host 
       valid_lft forever preferred_lft forever
2: eth0: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc pfifo_fast state UP group default qlen 1000
    link/ether b8:27:eb:f3:f7:5b brd ff:ff:ff:ff:ff:ff
    inet 192.168.1.6/24 brd 192.168.1.255 scope global eth0
       valid_lft forever preferred_lft forever
    inet6 fe80::ba27:ebff:fef3:f75b/64 scope link 
       valid_lft forever preferred_lft forever
</pre>

<p>
So the <code>org-mode</code> code for that looks like this
</p>

<pre class="example" id="org3f35b3b">
#+BEGIN_SRC shell :dir /ssh:home-kalipi:~/ :exports both :results output
ip addr
#+END_SRC
</pre>

<p>
That's great, I have all my <code>SSH</code> config, such as keys and what not for the host <code>home-kalipi</code> in <code>~/.ssh/config</code> and with <code>C-c</code> on the code block it executes.
With other tools like <code>msfconsole</code> I could do something like this.
</p>

<div class="org-src-container">
<pre class="src src-shell">msfconsole -q -x <span style="font-style: italic;">'use auxiliary/scanner/http/iis_internal_ip'</span> -x <span style="font-style: italic;">'set RHOSTS $target'</span> -x <span style="font-style: italic;">'set RPORT 80'</span> -x <span style="font-style: italic;">'set SSL false'</span> -x <span style="font-style: italic;">'run'</span>
</pre>
</div>

<pre class="example" id="orga19bd86">
RHOSTS =&gt; $target
RPORT =&gt; 80
SSL =&gt; false
[+] Location Header: http://10.8.9.40/
[+] Result for $target found Internal IP:  10.8.9.40
[+] Location Header: http://10.8.9.40/
[+] Result for $target found Internal IP:  10.8.9.40
[+] Location Header: http://10.8.9.40/
[+] Result for $target found Internal IP:  10.8.9.40
[*] Scanned 1 of 1 hosts (100% complete)
[*] Auxiliary module execution completed
msf auxiliary(scanner/http/iis_internal_ip) &gt; 
</pre>

<p>
<code>$target</code> would be the vulnerable <code>IP</code> in this case, and the <code>org-mode</code> code looks like this.
</p>

<pre class="example" id="org764013e">
#+BEGIN_SRC shell :dir /ssh:home-kalipi:/usr/share/metasploit-framework :results output :exports both
  msfconsole -q -x 'use auxiliary/scanner/http/iis_internal_ip' -x 'set RHOSTS $target' -x 'set RPORT 80' -x 'set SSL false' -x 'run'
#+END_SRC
</pre>
</div>
<ul class="org-ul">
<li><a id="org17840ec"></a>Internal devices<br />
<div class="outline-text-5" id="text-org17840ec">
<p>
So, a lot of the time for an internal penetration test, we would send <code>$client</code> an appliance of some sort and connect to it remotely. I'm a huge fan of using a reverse <code>SSH</code> shell to connect to internal appliances, but until recently I've not worked out how to do Literate Hacking via a reverse <code>SSH</code> connection. 
</p>

<p>
For this example, I'll use a <code>vps</code> and access the same internal device as above.
</p>

<ul class="org-ul">
<li><b>hax</b> = external public ip box</li>
<li><b>home-kalipi</b> = internal box</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">echo</span> $<span style="font-weight: bold; font-style: italic;">PWD</span> &amp;&amp; ls -lah &amp;&amp; ip a
</pre>
</div>

<pre class="example" id="orgc5b049f">
/opt
total 8.0K
drwxr-xr-x  2 root root 4.0K Oct 20  2017 .
drwxr-xr-x 22 root root 4.0K Apr 21  2017 ..
1: lo: &lt;LOOPBACK,UP,LOWER_UP&gt; mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1
 link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00
 inet 127.0.0.1/8 scope host lo
    valid_lft forever preferred_lft forever
 inet6 ::1/128 scope host 
    valid_lft forever preferred_lft forever
    2: eth0: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc pfifo_fast state UP group default qlen 1000
 link/ether b8:27:eb:f3:f7:5b brd ff:ff:ff:ff:ff:ff
 inet 192.168.1.6/24 brd 192.168.1.255 scope global eth0
    valid_lft forever preferred_lft forever
 inet6 fe80::ba27:ebff:fef3:f75b/64 scope link 
    valid_lft forever preferred_lft forever
</pre>

<pre class="example" id="orge65026d">
#+BEGIN_SRC shell :dir /ssh:hax|ssh:jthorpe@127.0.0.1#2222:/opt :results output : exports both
  echo $PWD &amp;&amp; ls -lah &amp;&amp; ip a
#+END_SRC
</pre>

<p>
So the initial connection to the <code>vps</code> is then passed to <code>127.0.0.1</code> and the port is specified with <code>#2222</code>. Pretty nifty :). I have found however that trying to do that with the <code>root</code> account and <code>org-mode</code> really does not like it, so setting up another account and configuring <code>sudo</code> not to ask for a password on that account is what I do now.
</p>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
